УТ_для_edt.РасширениеСмарт/src/Documents/CRM_Интерес/CRM_Интерес.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="afa0c775-67d2-41ec-9aa6-6ac947dfbdc6">
  <name>CRM_Интерес</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84450f4c-12f4-48e1-92d7-52e1fec0d1f1">
    <name>смартМенеджерСайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58a4348b-43e7-46fb-966f-fdf2e9858abd">
    <name>смартРабочаяПочта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9984e2d4-a5d7-4891-bd52-251aae7eea37">
    <name>смартРабочийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Заметки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстСодержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляРабочегоСтола</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаЗаметки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредставлениеПредмета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9cca9751-c599-4906-ad10-d4c17fd84503">
    <name>смартКвалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/CRM_Интерес/ObjectModule.bsl
#Область ПеренесеноСДоработкамиСмарт

&После("ПриЗаписи")
//++ #1698 смарт: Фролов 27.03.2024 //Оповещение Маркетинга и Коммерции о результатах обработки интереса менеджером.
Процедура смарт_ПриЗаписи(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Лид = Ссылка.ДокументОснование;
	
	Если ЗначениеЗаполнено(Лид) И ТипЗнч(Лид) = Тип("ДокументСсылка.смартЛид") Тогда
		
		Если ДополнительныеСвойства.ПредыдущееСостояниеИнтереса <> СостояниеИнтереса Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
			|ПОМЕСТИТЬ НомерКвалификации
			|ИЗ
			|	Справочник.CRM_СостоянияИнтересов
			|ГДЕ
			|	Родитель = &Родитель
			|	И ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.смартКвалификация)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CRM_СостоянияИнтересов.Ссылка КАК Квалификация
			|ИЗ
			|	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомерКвалификации КАК НомерКвалификации
			|		ПО CRM_СостоянияИнтересов.РеквизитДопУпорядочивания < НомерКвалификации.РеквизитДопУпорядочивания
			|ГДЕ
			|	CRM_СостоянияИнтересов.Родитель = &Родитель
			|	И НЕ CRM_СостоянияИнтересов.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CRM_СостоянияИнтересов.Ссылка КАК Квалификация
			|ИЗ
			|	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомерКвалификации КАК НомерКвалификации
			|		ПО CRM_СостоянияИнтересов.РеквизитДопУпорядочивания >= НомерКвалификации.РеквизитДопУпорядочивания
			|ГДЕ
			|	CRM_СостоянияИнтересов.Родитель = &Родитель
			|	И НЕ CRM_СостоянияИнтересов.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
			|;
			//++ #Б-3480 смарт: Фролов 02.06.2025 //Добавить нескольких получателей рассылки при закрытии интересов.
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Значение КАК Контролер
			|ИЗ
			|	Справочник.смартПредопределенныеЗначения.Значения
			|ГДЕ
			|	Ссылка = &Контролеры
			|;
			//-- #Б-3480 смарт: Фролов 02.06.2025
			//++ #1772 смарт: Фролов 11.04.2024 //Отправка сообщений о квалификации Интересов успешных и не успешных конкретному получателю по указанным менеджерам
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Значение КАК Менеджер
			|ИЗ
			|	Справочник.смартПредопределенныеЗначения.Значения
			|ГДЕ
			|	Ссылка = &ПредопределенноеЗначение");
			Запрос.УстановитьПараметр("ПредопределенноеЗначение", Справочники.смартПредопределенныеЗначения.КонтролируемыеМенеджеры);
			//-- #1772 смарт: Фролов 11.04.2024
			Запрос.УстановитьПараметр("Родитель", СостояниеИнтереса.Родитель);
			//++ #Б-3480 смарт: Фролов 02.06.2025 //Добавить нескольких получателей рассылки при закрытии интересов.
			Запрос.УстановитьПараметр("Контролеры", Справочники.смартПредопределенныеЗначения.КонтролерРезультатовОбрабооткиИнтересов);
			//-- #Б-3480 смарт: Фролов 02.06.2025
			
			МассивРезультатов = Запрос.ВыполнитьПакет();
			МасссивДо = МассивРезультатов[1].Выгрузить().ВыгрузитьКолонку("Квалификация");
			МасссивПосле = МассивРезультатов[2].Выгрузить().ВыгрузитьКолонку("Квалификация");
			//++ #Б-3480 смарт: Фролов 02.06.2025 //Добавить нескольких получателей рассылки при закрытии интересов.
			//++ #1772 смарт: Фролов 11.04.2024 //Отправка сообщений о квалификации Интересов успешных и не успешных конкретному получателю по указанным менеджерам
			//МассивКонтролируемых = МассивРезультатов[3].Выгрузить().ВыгрузитьКолонку("Менеджер");
			//-- #1772 смарт: Фролов 11.04.2024
			МассивКонтролеров = МассивРезультатов[3].Выгрузить().ВыгрузитьКолонку("Контролер");
			МассивКонтролируемых = МассивРезультатов[4].Выгрузить().ВыгрузитьКолонку("Менеджер");
			//-- #Б-3480 смарт: Фролов 02.06.2025
			
			Вариант = "";
			
			Если СостояниеИнтереса.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение
				И НЕ ДополнительныеСвойства.ПредыдущееСостояниеИнтереса.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение Тогда
				
				//Отправляем письмо о неудаче
				Вариант = "ПисьмоОНеудачномЗавершении";
				
				//++ #Б-2140 смарт: Фролов 11.02.2025 //Ввод нового регламента. Убрать автоматическое создание заметок при квалификации Интереса
				//++ #1833 смарт: Фролов 27.05.2024 //Автоматическое создание заметок при квалификации интереса.
				//смартСоздатьЗаметкуОКвалификации(Вариант);
				//-- #1833 смарт: Фролов 27.05.2024
				//-- #Б-2140 смарт: Фролов 11.02.2025 
				
				//++ #Б-4872 смарт: Фролов 05.11.2025 //Текущие задачи по CRM.
				МассивПричин = Справочники.смартПредопределенныеЗначения.Настройки.ПричиныОтказаДляВозвратаВОчередь.ВыгрузитьКолонку("ПричинаОтказа");
				
				//++ #Б-3650 смарт: Фролов 27.06.2025 //При закрытии Интереса с причиной "Дубль", возвращать очередь менеджера.
				//Если ПричинаОтказа = Справочники.смартПредопределенныеЗначения.Настройки.ПричинаОтказаДубль Тогда
				Если НЕ МассивПричин.Найти(ПричинаОтказа) = Неопределено Тогда
				//-- #Б-4872 смарт: Фролов 05.11.2025	
					
					НаборЗаписей = РегистрыСведений.смартВыдачаЛидов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Менеджер.Установить(Ответственный);
					НаборЗаписей.Отбор.Квалификация.Установить(смартПредварительнаяКвалификация);
					НаборЗаписей.Прочитать();
					
					Если НаборЗаписей.Количество() > 0 Тогда
						
						ИзменениеВыдачи = НаборЗаписей[0].ВыданоЛидов - 1;
						Если ИзменениеВыдачи < 0 Тогда
							ИзменениеВыдачи = 0;
						ИначеЕсли ИзменениеВыдачи > НаборЗаписей[0].ВыдатьЛидов Тогда
							ИзменениеВыдачи = НаборЗаписей[0].ВыдатьЛидов;
						КонецЕсли;	
						НаборЗаписей[0].ВыданоЛидов = ИзменениеВыдачи;
						
						НаборЗаписей.Записать(Истина);
						
					КонецЕсли;
					
					НаборЗаписей = РегистрыСведений.смартОбщаяОчередьВыдачиЛидов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Менеджер.Установить(Ответственный);
					НаборЗаписей.Прочитать();
					НаборЗаписей.Очистить();
					
					СтрокаНаборЗаписей = НаборЗаписей.Добавить();
					СтрокаНаборЗаписей.Менеджер = Ответственный;
					СтрокаНаборЗаписей.ДатаНачала = ТекущаяДата();
					
					НаборЗаписей.Записать(Истина);
					
				КонецЕсли;	
				//-- #Б-3650 смарт: Фролов 27.06.2025
				
			ИначеЕсли НЕ МасссивДо.Найти(ДополнительныеСвойства.ПредыдущееСостояниеИнтереса) = Неопределено 
				И НЕ МасссивПосле.Найти(СостояниеИнтереса) = Неопределено Тогда
				
				//Отправляем письмо о квалификации
				Вариант = "ПисьмоОКвалификации";
				
				//++ #Б-2140 смарт: Фролов 11.02.2025 //Ввод нового регламента. Убрать автоматическое создание заметок при квалификации Интереса
				//++ #1833 смарт: Фролов 27.05.2024 //Автоматическое создание заметок при квалификации интереса.
				//смартСоздатьЗаметкуОКвалификации(Вариант);
				//-- #1833 смарт: Фролов 27.05.2024
				//-- #Б-2140 смарт: Фролов 11.02.2025
				
			КонецЕсли;	
			
			Если НЕ Вариант = "" Тогда
				
				УчетнаяЗапись=смартОбщегоНазначения.смартПолучитьУчетнуюЗаписьЭППользователя(Ответственный);
				
				ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
				ТестовыеАдресаСтрока = "";
				ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 
				
				АдресаДляОтправкиСтрокой = "";
				
				//++ #Б-6630 смарт: Фролов 28.05.2026 //Сделать механизм оповещений о новых Инцидентах.
				//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.
				//Если Вариант = "ПисьмоОКвалификации" Тогда
				//	МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомленийПоТипуПродукта(
				//		?(ЗначениеЗаполнено(смартИтоговаяКвалификация), смартИтоговаяКвалификация, смартПредварительнаяКвалификация), Ответственный, АдресаДляОтправкиСтрокой, "Квалификация"); 
				//Иначе
				//	МассивАдресовДляОтправки = смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомленийПоТипуПродукта(
				//		?(ЗначениеЗаполнено(смартИтоговаяКвалификация), смартИтоговаяКвалификация, смартПредварительнаяКвалификация), Ответственный, АдресаДляОтправкиСтрокой, "Завершенные");	
				//КонецЕсли;
				
				Если Вариант = "ПисьмоОКвалификации" Тогда
					МассивПользователей = смартОбщегоНазначения.ПолучитьПользователейПоНастройкамОбОповещениях("Интересы", Ответственный.Подразделение, 
						?(ЗначениеЗаполнено(смартИтоговаяКвалификация), смартИтоговаяКвалификация.ТипПродукта, смартПредварительнаяКвалификация.ТипПродукта), "Квалификация");
				Иначе
					МассивПользователей = смартОбщегоНазначения.ПолучитьПользователейПоНастройкамОбОповещениях("Интересы", Ответственный.Подразделение, 
						?(ЗначениеЗаполнено(смартИтоговаяКвалификация), смартИтоговаяКвалификация.ТипПродукта, смартПредварительнаяКвалификация.ТипПродукта), "Завершенные");
						
					//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.
					ЗапросКонтролируемые = Новый Запрос(
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Пользователи.смартКонтролируемыеМенеджеры
					|ГДЕ
					|	Пользователь = &Ответственный");
					ЗапросКонтролируемые.УстановитьПараметр("Ответственный", Ответственный);
					
					ВыборкаКонтролируемые = ЗапросКонтролируемые.Выполнить().Выбрать();
					
					Пока ВыборкаКонтролируемые.Следующий() Цикл
						
						Если МассивПользователей.Найти(ВыборкаКонтролируемые.Ссылка) = Неопределено Тогда
							МассивПользователей.Добавить(ВыборкаКонтролируемые.Ссылка);
						КонецЕсли;	
						
					КонецЦикла;	
					//-- #Б-7838 смарт: Фролов 12.08.2026
						
				КонецЕсли;
					
				МассивАдресовДляОтправки = Новый Массив;	
				
				Если НЕ МассивПользователей = Неопределено Тогда
					
					Для Каждого Пользователь Из МассивПользователей Цикл
						
						МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес, Представление", Пользователь.смартРабочаяПочта, Пользователь.смартРабочаяПочта));
						АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + Пользователь.смартРабочаяПочта;
						
					КонецЦикла;
					
				КонецЕсли;
				//-- #Б-6630 смарт: Фролов 28.05.2026
	
				Если МассивАдресовДляОтправки.Количество() = 0 Тогда
					
					МассивАдресовДляОтправки=смартОбщегоНазначения.смартПолучитьАдресаПолучателейУведомлений(Справочники.смартПредопределенныеЗначения.ПолучателиОтчетаПоРаспределениюЛидов, АдресаДляОтправкиСтрокой);
					
				КонецЕсли;
				//-- #Б-3858 смарт: Фролов 21.07.2025
				
				//++ #Б-2042 смарт: Фролов 04.02.2025 //Уведомления о Лидах и Интересах
				//++ #1790 смарт: Фролов 23.04.2024 //Оповещение руководителей подразделений о неудачно завершенных Интересах их сотрудников по почте.
				//ЦФО=Справочники.смартПредопределенныеЗначения.ЦентральныйФО.Значение;
				ГоловнойОфисМосква=Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение;
				ПодразделениеПользователя = Ответственный.Подразделение;
				МассивАдресовРуководителей = Новый Массив;
				
				//Если ЗначениеЗаполнено(ПодразделениеПользователя) И НЕ ПодразделениеПользователя = ЦФО И Вариант = "ПисьмоОНеудачномЗавершении" Тогда
				Если ЗначениеЗаполнено(ПодразделениеПользователя) И НЕ ПодразделениеПользователя = ГоловнойОфисМосква Тогда	
				//-- #Б-2042 смарт: Фролов 04.02.2025	
					
					Если ЗначениеЗаполнено(ПодразделениеПользователя.ТекущийРуководитель) Тогда
						
						МассивАдресовРуководителей = смартОбщегоНазначения.ПолучитьАдресПользователяПоФизЛицу(ПодразделениеПользователя.ТекущийРуководитель, АдресаДляОтправкиСтрокой);	
						
					КонецЕсли;	
					
				КонецЕсли;
				
				ТекКвалификация = ?(ЗначениеЗаполнено(смартИтоговаяКвалификация), смартИтоговаяКвалификация, смартПредварительнаяКвалификация);
				
				МассивАдресовПоКвалифиации = смартОбщегоНазначения.ПолучитьАдресаПолучателейУведомленийПоКвалификации(ТекКвалификация, АдресаДляОтправкиСтрокой);
				
				Для Каждого СтрМассивАдресовПоКвалифиации Из МассивАдресовПоКвалифиации Цикл
					МассивАдресовДляОтправки.Добавить(СтрМассивАдресовПоКвалифиации);	
				КонецЦикла;	
				//-- #1790 смарт: Фролов 23.04.2024
				
				ТекстПисьма = "";
				
				НавСсылка=ПолучитьНавигационнуюСсылку(Ссылка);
				
				Если ТипЗнч(Лид.ДокументОснование) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
					
					Если Лид.ДокументОснование.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
						ТекстСодержания = Взаимодействия.ПолучитьОбычныйТекстИзHTML(Лид.ТекстИсточника);
					Иначе	
						ТекстСодержания = Лид.ТекстИсточника;
					КонецЕсли;
					
				Иначе
					
					ТекстСодержания = Лид.ТекстИсточника;
					
				КонецЕсли;
				
				Если Вариант = "ПисьмоОНеудачномЗавершении" Тогда
					
					ТемаПисьма = "Интерес завершен неудачно";
					
					ТекстПисьма = ТекстПисьма + "/--------------------------------------------------------------/" + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Интерес завершен неудачно: " + Символы.ПС + Символы.ПС + Символы.ПС;
					ТекстПисьма = ТекстПисьма + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + " | " + Тема + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Тип услуги: " + ТипУслуги + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Навигационная ссылка на документ: " + НавСсылка + "" + Символы.ПС + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Текущий этап: " + СостояниеИнтереса + "" + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Менеджер: " + Ответственный + "" + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Причина: " + ПричинаОтказа + "" + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Комметарий менеджера: " + ПричинаОтказаКомментарий + "" + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "=================================================================================" + Символы.ПС + Символы.ПС;
					ТекстПисьма = ТекстПисьма + ТекстСодержания + Символы.ПС;
					
				Иначе
					
					ТемаПисьма = "Интерес квалифицирован";
					
					ТекстПисьма = ТекстПисьма + "/--------------------------------------------------------------/" + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Интерес квалифицирован: " + Символы.ПС + Символы.ПС + Символы.ПС;
					ТекстПисьма = ТекстПисьма + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + " | " + Тема + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Тип услуги: " + ТипУслуги + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Навигационная ссылка на документ: " + НавСсылка + Символы.ПС + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Текущий этап: " + СостояниеИнтереса + "" + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Менеджер: " + Ответственный + "" + Символы.ПС;
					//++ #1909 смарт: Фролов 09.07.2024 //Организовать корректный пересчет валют в Интересе.
					ТекстПисьма = ТекстПисьма + "Ожидаемая выручка: " + смартОжидаемаяВыручкаВВалютеДокумента + " " + Валюта + Символы.ПС;
					//-- #1909 смарт: Фролов 09.07.2024
					ТекстПисьма = ТекстПисьма + "Ожидаемая дата продажи: " + Формат(ОжидаемаяДатаПродажи, "ДФ=dd.MM.yyyy") + "" + Символы.ПС + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "Описание потребности: " + Описание + "" + Символы.ПС;
					ТекстПисьма = ТекстПисьма + "=================================================================================" + Символы.ПС + Символы.ПС;
					ТекстПисьма = ТекстПисьма + ТекстСодержания + Символы.ПС;
					
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(УчетнаяЗапись)
					И (ТестовыеАдресаМассив.Количество() > 0
					ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
					
					ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
					ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, МассивАдресовРуководителей, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
					
					УстановитьПривилегированныйРежим(Истина);
					
					Попытка
						
						//++ #1772 смарт: Фролов 11.04.2024 //Отправка сообщений о квалификации Интересов успешных и не успешных конкретному получателю по указанным менеджерам
						Если НЕ МассивКонтролируемых.Найти(Ответственный) = Неопределено Тогда
							
							//++ #Б-3480 смарт: Фролов 02.06.2025 //Добавить нескольких получателей рассылки при закрытии интересов.
							//АдресКонтролера = Справочники.смартПредопределенныеЗначения.КонтролерРезультатовОбрабооткиИнтересов.Значение;
							//
							//Если ЗначениеЗаполнено(АдресКонтролера) Тогда
							//	
							//	МассивАдресов = Новый Массив;
							//	
							//	МассивАдресов.Добавить(Новый Структура("Адрес,Представление", АдресКонтролера, АдресКонтролера));
							//	
							//	ПараметрыПисьма.Вставить("СкрытыеКопии", МассивАдресов);
							//
							//КонецЕсли;
							
							МассивАдресов = Новый Массив;
							
							Для Каждого Пользователь Из МассивКонтролеров Цикл
								
								МассивАдресов.Добавить(Новый Структура("Адрес, Представление", Пользователь.смартРабочаяПочта, 
									Пользователь.смартРабочаяПочта));

							КонецЦикла;
								
							ПараметрыПисьма.Вставить("СкрытыеКопии", МассивАдресов);
							//-- #Б-3480 смарт: Фролов 02.06.2025
								
						КонецЕсли;	
						//-- #1772 смарт: Фролов 11.04.2024
						
						ИдентификаторОснования = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
						
						НаборЗаписей = РегистрыСведений.смартСвязьИнтересаСПочтовымиСообщениями.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Интерес.Установить(Ссылка);
						НаборЗаписей.Отбор.ИдентификаторОснования.Установить(ИдентификаторОснования);
						НаборЗаписей.Прочитать();
						
						Если НаборЗаписей.Количество() = 0 Тогда
							
							СтрНаборЗаписей = НаборЗаписей.Добавить();
							СтрНаборЗаписей.Интерес = Ссылка;
							СтрНаборЗаписей.ИдентификаторОснования = ИдентификаторОснования;
							СтрНаборЗаписей.Отправитель = УчетнаяЗапись;
							
							НаборЗаписей.Записать();
							
						КонецЕсли;	
						
						Если ПараметрыПисьма.ТестоваяБаза Тогда
							ТекстСообщения = "Отправлено письмо, " + ?(Вариант="ПисьмоОНеудачномЗавершении", " о не удачном завершении интереса", " о квалафикации интереса") 
							+ ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
						Иначе
							ТекстСообщения = "Отправлено письмо, " + ?(Вариант="ПисьмоОНеудачномЗавершении", " о не удачном завершении интереса", " о квалафикации интереса") + АдресаДляОтправкиСтрокой;
						КонецЕсли;
						
						ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
						
					Исключение
						
						ТекстСообщения = "Не удалось отправить письмо, " + ?(Вариант="ПисьмоОНеудачномЗавершении", " о не удачном завершении интереса", " о квалафикации интереса") + Символы.ПС + ОписаниеОшибки(); 
						
						ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
						
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//++ #1749 смарт: Фролов 11.04.2024 //При изменении ответственного в Интересе остаются напоминания старому ответственному, нужно очищать.
	Если ДополнительныеСвойства.Свойство("ПредыдущийОтветственный") Тогда

		Если ДополнительныеСвойства.ПредыдущийОтветственный <> Ответственный Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Пользователь КАК Пользователь,
			|	ВремяСобытия КАК ВремяСобытия,
			|	Источник КАК Источник
			|ИЗ
			|	РегистрСведений.НапоминанияПользователя
			|ГДЕ
			|	(Источник.ДокументОснование = &Ссылка
			|	ИЛИ Источник = &Ссылка)
			|	И НЕ Пользователь = Источник.ДокументОснование.Ответственный");
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.НапоминанияПользователя.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь);
				НаборЗаписей.Отбор.ВремяСобытия.Установить(Выборка.ВремяСобытия);
				НаборЗаписей.Отбор.Источник.Установить(Выборка.Источник);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать();
				
			КонецЦикла;	
			
			//++ #1778 смарт: Фролов 17.04.2024 //Оповещений менеджеров о назначенных Интересах.
			
			УстановитьПривилегированныйРежим(Истина);
			
			смартПредыдущийОтветственный = ДополнительныеСвойства.ПредыдущийОтветственный;
			
			//++ #1904 смарт: Фролов 08.07.2024 //При изменении ответственного в Интересе меняем в Лиде
			Если ЗначениеЗаполнено(Лид) И (ТипЗнч(Лид) = Тип("ДокументСсылка.смартЛид") 
				ИЛИ ТипЗнч(Лид) = Тип("ДокументСсылка.CRM_Заявка"))Тогда
				
				ОбъектЛид = Лид.ПолучитьОбъект();
				ОбъектЛид.Ответственный = Ответственный;
				ОбъектЛид.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;	
			//-- #1904 смарт: Фролов 08.07.2024
			
			//++ #Б-1116 смарт: Фролов 17.10.2024 //Создание общей очереди в механизме распределения Интересов
			НаборЗаписей = РегистрыСведений.смартОбщаяОчередьВыдачиЛидов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Менеджер.Установить(смартПредыдущийОтветственный);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			СтрокаНаборЗаписей = НаборЗаписей.Добавить();
			СтрокаНаборЗаписей.Менеджер = смартПредыдущийОтветственный;
			СтрокаНаборЗаписей.ДатаНачала = ТекущаяДата();
			
			НаборЗаписей.Записать(Истина);
			//-- #Б-1116 смарт: Фролов 17.10.2024

			
			//++ #1988 смарт: Фролов 14.08.2024 //Ошибка, приходит оповещение о новом интересе сотруднику блокирующему выдачу.
			// добавлена проверка на пустого ответственного
			Если ЗначениеЗаполнено(Ответственный) Тогда
				
				смартСобытияВзаимодействий.ЗарегистрироватьСобытиеВзаимодействия(Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес,
					"СозданНовыйИнтерес", Ссылка);
					
				//++ #Б-1116 смарт: Фролов 17.10.2024 //Создание общей очереди в механизме распределения Интересов
				смартСервер.УдалитьМенеджераИзОбщейОчереди(Ответственный);
				//-- #Б-1116 смарт: Фролов 17.10.2024
				
				//++ #Б-1214 смарт: Фролов 29.10.2024 //Регистрация в ИМ. Лид-Интерес. Проверка взаимодействия перед подтверждением
				Если смартИтоговаяКвалификация = Справочники.смартКвалификацииМенеджеров.РегистрацияПользователяНаСайте Тогда
					
					Запрос = Новый Запрос(
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	Ссылка КАК Ссылка
					|ИЗ
					|	Задача.ЗадачаИсполнителя
					|ГДЕ
					|	Предмет = &Предмет
					|	И НЕ Выполнена
					|	И смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.СозвонитьсяСКлиентом)");
					Запрос.УстановитьПараметр("Предмет", Ссылка);
					
					Выборка = Запрос.Выполнить().Выбрать();
					Пока Выборка.Следующий() Цикл
						
						ОбъектЗадача = Выборка.Ссылка.ПолучитьОбъект();
						ОбъектЗадача.Исполнитель = Ответственный;
						ОбъектЗадача.Записать();
						
					КонецЦикла;	
					
				КонецЕсли;	
				//-- #Б-1214 смарт: Фролов 29.10.2024
					
			КонецЕсли;		
			//-- #1988 смарт: Фролов 14.08.2024
			
			//-- #1778 смарт: Фролов 17.04.2024
			
		КонецЕсли;
		
	//++ #1778 смарт: Фролов 17.04.2024 //Оповещений менеджеров о назначенных Интересах.
	ИначеЕсли ДополнительныеСвойства.ЭтоНовый И ЗначениеЗаполнено(Лид) Тогда 	
		
		УстановитьПривилегированныйРежим(Истина);
		
		смартСобытияВзаимодействий.ЗарегистрироватьСобытиеВзаимодействия(Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес,
				"СозданНовыйИнтерес", Ссылка);
	//-- #1778 смарт: Фролов 17.04.2024
		
	КонецЕсли;
	//-- #1749 смарт: Фролов 11.04.2024
	
	//++ #1981 смарт: Фролов 21.08.2024 //Показ заметок по результатам квалификации Интереса в карточке Партнера.
	ТекПартнер = Ссылка.Партнер;
	Если ЗначениеЗаполнено(ТекПартнер) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Заметки.Ссылка КАК Заметка
		|ИЗ
		|	Справочник.Заметки КАК Заметки
		|ГДЕ
		|	(Заметки.смартПартнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|			ИЛИ Заметки.смартПартнер <> &ТекПартнер)
		|	И Заметки.Предмет = &Интерес");
		
		Запрос.УстановитьПараметр("ТекПартнер", ТекПартнер);
		Запрос.УстановитьПараметр("Интерес", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбъектЗаметка = Выборка.Заметка.ПолучитьОбъект();
			ОбъектЗаметка.смартПартнер = ТекПартнер;
			ОбъектЗаметка.Записать();
			
		КонецЦикла;	
		
	КонецЕсли;
	//-- #1981 смарт: Фролов 21.08.2024
	
	//++ #Б-3860 смарт: Фролов 15.08.2025 //CRM. Продажа оборудования. Дополнительные условия на этапе
	Если ДополнительныеСвойства.ПредыдущаяДатаОтправкиДоговора <> смартДатаОтправкиДоговора 
		И ЗначениеЗаполнено(смартДатаОтправкиДоговора) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		ЗадачаОбъект.Дата = ТекущаяДатаСеанса();
		ЗадачаОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
		ЗадачаОбъект.Исполнитель = Ответственный;
		ЗадачаОбъект.Предмет = Ссылка;
		ЗадачаОбъект.ПредметСтрокой = Строка(Ссылка);
		ЗадачаОбъект.CRM_Личная = Истина;
		ЗадачаОбъект.CRM_Партнер = Партнер.Ссылка;
		ЗадачаОбъект.Автор = Пользователи.ТекущийПользователь();
		ЗадачаОбъект.ДатаНачала = ТекущаяДата() + 300;
		ЗадачаОбъект.ПринятаКИсполнению = Истина;
		ЗадачаОбъект.СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
		
		//++ #Б-4290 смарт: Фролов 11.09.2025 //Доработки Автозадач
		//НомерДня = 1;
		//ДатаПроверки = ТекущаяДата() + 86400;
		//Пока НомерДня < 3 Цикл
		//	
		//	Если ДатаЯвляетсяРабочей(ДатаПроверки) Тогда
		//		
		//		ДатаПроверки = ДатаПроверки + 86400;
		//		НомерДня = НомерДня + 1;
		//		
		//	Иначе	
		//		
		//		ДатаПроверки = ДатаПроверки + 86400;
		//		
		//	КонецЕсли;	
		//	
		//КонецЦикла;
		//
		//Пока НЕ ДатаЯвляетсяРабочей(ДатаПроверки) Цикл
		//	
		//	ДатаПроверки = ДатаПроверки + 86400;	
		//	
		//КонецЦикла;	
		//
		//ЗадачаОбъект.СрокИсполнения = ДатаПроверки;
		//++ #Б-4374 смарт: Фролов 17.09.2025 //Ошибка ЖР. Документ Интерес 
 		ЗадачаОбъект.СрокИсполнения = смартОбщегоНазначения.ПолучитьРабочуюДатуОтносительноИсходной(ТекущаяДата(), 3, "Вперед");
		//ЗадачаОбъект.СрокИсполнения = смартОбщегоНазначения.ПолучитьРабочуюДатуОтносительноТекущей(ТекущаяДата(), 3, "Вперед");
		//-- #Б-4374 смарт: Фролов 17.09.2025
		//-- #Б-4290 смарт: Фролов 11.09.2025
		
		ЗадачаОбъект.смартВидЗадачи = Справочники.смартВидыЗадач.ПолучитьПодписанныйДоговор;
		
		ЗадачаОбъект.Описание = "Получить подписанный договор от клиента";
		ЗадачаОбъект.Наименование = "Получить подписанный договор от клиента";
		ЗадачаОбъект.Записать();
		
	КонецЕсли;
	//-- #Б-3860 смарт: Фролов 15.08.2025
	
	//++ #Б-2354 смарт: Фролов 17.02.2025 //Ввод нового регламента. Вывод данных из регистра состояние партнеров.
	//++ #Б-1354 смарт: Фролов 14.11.2024 //Алгоритмы заполнения регистра Состояния партнеров
	//Если ДополнительныеСвойства.ПредыдущийПартнер <> Партнер 
	//	ИЛИ ДополнительныеСвойства.ПредыдущееСостояниеИнтереса <> СостояниеИнтереса Тогда
	//	
	//	смартОпределитьИУстановитьСтатусПартнера(ДополнительныеСвойства.ПредыдущийПартнер);
	//	
	//КонецЕсли;
	//-- #Б-1354 смарт: Фролов 14.11.2024
	//-- #Б-2354 смарт: Фролов 17.02.2025
	
КонецПроцедуры //-- #1698 смарт: Фролов 27.03.2024

&После("ПередЗаписью")
//++ #1909 смарт: Фролов 17.07.2024 //Организовать корректный пересчет валют в Интересе.
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
	смартОжидаемаяВыручкаВВалютеДокумента = РаботаСКурсамиВалют.ПересчитатьВВалюту(ОжидаемаяВыручка, ВалютаУправленческогоУчета, Валюта, Дата);
	
	//++ #Б-1354 смарт: Фролов 14.11.2024 //Алгоритмы заполнения регистра Состояния партнеров
	ПредыдущийПартнер = Ссылка.Партнер;
	ДополнительныеСвойства.Вставить("ПредыдущийПартнер", ПредыдущийПартнер);
	//-- #Б-1354 смарт: Фролов 14.11.2024 
	
	//++ #Б-3860 смарт: Фролов 15.08.2025 //CRM. Продажа оборудования. Дополнительные условия на этапе
	ДополнительныеСвойства.Вставить("ПредыдущаяДатаОтправкиДоговора", Ссылка.смартДатаОтправкиДоговора);
	//-- #Б-3860 смарт: Фролов 15.08.2025
	
КонецПроцедуры //-- #1909 смарт: Фролов 17.07.2024

//++ #Б-2168 смарт: Лопато 07.02.2025 //Создание интереса из заявки на ремонтное обслуживание  
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		ДокументОснование	= ДанныеЗаполнения.Ссылка;
		КонтактноеЛицо		= ДанныеЗаполнения.КонтактноеЛицо;
		// ОжидаемаяВыручка	= ДанныеЗаполнения.ОжидаемаяВыручка;
		Описание			= ДанныеЗаполнения.Описание;
		Партнер				= ДанныеЗаполнения.Партнер;
		ПотенциальныйКлиент	= ДанныеЗаполнения.ПотенциальныйКлиент;
		ТипУслуги			= ДанныеЗаполнения.ТипУслуги;
		Тема				= ДанныеЗаполнения.Тема;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Партнеры") Тогда
		Если ДанныеЗаполнения.Ссылка.ЭтоГруппа Тогда
			СтандартнаяОбработка = Ложь;	
			Возврат;
		КонецЕсли;	
		Партнер				= ДанныеЗаполнения.Ссылка;		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Автор") Тогда
			Автор = ДанныеЗаполнения.Автор;
		КонецЕсли;
		Дата = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
		Если ДанныеЗаполнения.Свойство("Партнер") Тогда
			Партнер = ДанныеЗаполнения.Партнер;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("КонтактноеЛицо") Тогда
			Если ЗначениеЗаполнено(ДанныеЗаполнения.КонтактноеЛицо) Тогда
				КонтактноеЛицо = ДанныеЗаполнения.КонтактноеЛицо;
			ИначеЕсли ЗначениеЗаполнено(Партнер) Тогда
				Если  ЗначениеЗаполнено(Партнер.CRM_ОсновноеКонтактноеЛицо) Тогда
					КонтактноеЛицо = Партнер.CRM_ОсновноеКонтактноеЛицо; 
				Иначе
					КонтактноеЛицо = CRM_МетодыМодулейМенеджеровДокументов.ВернутьКЛПартнера(Партнер);;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ПотенциальныйКлиент") Тогда
			ПотенциальныйКлиент = ДанныеЗаполнения.ПотенциальныйКлиент;
		КонецЕсли;		
		Если ДанныеЗаполнения.Свойство("Описание") Тогда
			Описание = ДанныеЗаполнения.Описание;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Организация") Тогда
			Организация = ДанныеЗаполнения.Организация;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Ответственный") Тогда
			Ответственный = ДанныеЗаполнения.Ответственный;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Подразделение") Тогда
			Подразделение = ДанныеЗаполнения.Подразделение;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Офис") Тогда
			Офис = ДанныеЗаполнения.Офис;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("СостояниеИнтереса") Тогда
			СостояниеИнтереса = ДанныеЗаполнения.СостояниеИнтереса;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("СостояниеИнтереса") Тогда
			СостояниеИнтереса = ДанныеЗаполнения.СостояниеИнтереса;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Тема") Тогда
			Тема = ДанныеЗаполнения.Тема;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ТипУслуги") Тогда
			ТипУслуги = ДанныеЗаполнения.ТипУслуги;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.БизнесПроцесс) Тогда
			Партнер			= ДанныеЗаполнения.БизнесПроцесс.Партнер;
			КонтактноеЛицо	= ДанныеЗаполнения.БизнесПроцесс.КонтактноеЛицо;
			Организация		= ДанныеЗаполнения.БизнесПроцесс.Организация;
			Ответственный	= ДанныеЗаполнения.БизнесПроцесс.Ответственный;
			Подразделение	= ДанныеЗаполнения.БизнесПроцесс.Подразделение;
		КонецЕсли;
		
		Дата = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
		Тема = ДанныеЗаполнения.Наименование;
		Описание = ДанныеЗаполнения.Описание;
		
	#Вставка
	//++ #Б-2168 смарт: Лопато 07.02.2025 //Создание интереса из заявки на ремонтное обслуживание  
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартРегламентноеОбслуживаниеКлиентов") Тогда

		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Партнер			  = ДанныеЗаполнения.Клиент;		
		КонтактноеЛицо 	  = Партнер.CRM_ОсновноеКонтактноеЛицо;
		
	//-- #Б-2168 смарт: Лопато 07.02.2025

	//++ #Б-2322 смарт: Лопато 17.02.2025 //Создания интереса из "Заявки на ремонтные работы"  
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда

		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Партнер			  = ДанныеЗаполнения.Партнер;		
		ТипУслуги 		  = Справочники.CRM_ТипУслуги.ПоставкаЗапасныеЧасти;
		Валюта			  = Константы.ВалютаРегламентированногоУчета.Получить();
		СостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000036");
		Тема 			  = "Создан на основании ""Заявки на рем. работы""  № " + ДанныеЗаполнения.Ссылка.Номер + ", " + СокрЛП(Партнер);
		Ответственный	  = ПараметрыСеанса.ТекущийПользователь;
		Подразделение	  = Ответственный.Подразделение;
		Офис			  = Подразделение.CRM_Офис;
	//-- #Б-2322 смарт: Лопато 17.02.2025 
	
	//++ #6224 смарт: Тимофеева 13.04.2026 / Расчет бонусов инженеров за маркетинговые мероприятия
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.МаркетинговыеМероприятияДокумент") Тогда

		//++ #Б7290 смарт: Шляпников 09.07.2026 / Документ "Маркетинговое мероприятие". Связь к Интересу "один ко многим".
		Если ЗначениеЗаполнено(ДанныеЗаполнения.смартИнтерес) Тогда
			Сообщить("В маркетинговом предприятии уже указан Интерес. Вводить на его основании другой интерес нельзя.");
			Возврат;
		КонецЕсли;
		//-- #Б7290 смарт: Шляпников 09.07.2026
		
		смартМаркетинговоеМероприятие 	= ДанныеЗаполнения.Ссылка;
		Партнер			  			 	= ДанныеЗаполнения.КлиентПартнер;		
		Валюта			  				= Константы.ВалютаРегламентированногоУчета.Получить();
		СостояниеИнтереса 				= Справочники.CRM_СостоянияИнтересов.НайтиПоКоду("00000036");
		//++ #Б-7068 смарт: Фролов 04.06.2026 //Создание интереса из ММ, и наоборот. Ошибки и предложения
		Если ЗначениеЗаполнено(СостояниеИнтереса) И СостояниеИнтереса.смартТипыУслуг.Количество() > 0 Тогда
			
			ТипУслуги 						= СостояниеИнтереса.смартТипыУслуг[0].ТипУслуги;
			
		КонецЕсли;	
		//-- #Б-7068 смарт: Фролов 04.06.2026
		Ответственный	  				= ПараметрыСеанса.ТекущийПользователь;
		Подразделение	  				= Ответственный.Подразделение;
		Офис			  				= Подразделение.CRM_Офис;

	//-- #6224 смарт: Тимофеева 13.04.2026 
	#КонецВставки

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ #Б-4290 смарт: Фролов 11.09.2025 //Доработки Автозадач
//Функция ДатаЯвляетсяРабочей(ДатаПроверки)
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", КалендарныеГрафики.ОсновнойПроизводственныйКалендарь());
//	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ДатаПроверки));
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	Дата
//	|ИЗ
//	|	РегистрСведений.ДанныеПроизводственногоКалендаря
//	|ГДЕ
//	|	ПроизводственныйКалендарь = &ПроизводственныйКалендарь
//	|	И Дата = &ТекущаяДата
//	|	И ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), 
//	|				ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))";
//	
//	Возврат Запрос.Выполнить().Выбрать().Следующий();
//	
//КонецФункции
//-- #Б-4290 смарт: Фролов 11.09.2025

//++ #Б-2354 смарт: Фролов 17.02.2025 //Ввод нового регламента. Вывод данных из регистра состояние партнеров.
//Отключил код согласно задачи

//++ #Б-1354 смарт: Фролов 14.11.2024 //Алгоритмы заполнения регистра Состояния партнеров
//Процедура смартОпределитьИУстановитьСтатусПартнера(ПредыдущийПартнер)
//	
//	Если ЗначениеЗаполнено(ПредыдущийПартнер) Тогда
//		
//		Если ПредыдущийПартнер <> Партнер Тогда
//			
//			смартДействияПоИзменениюСтатусаПартнера(ПредыдущийПартнер);
//			смартДействияПоИзменениюСтатусаПартнера(Партнер);
//			
//		Иначе
//			
//			смартДействияПоИзменениюСтатусаПартнера(Партнер);
//			
//		КонецЕсли;	
//			
//	Иначе
//		
//		смартДействияПоИзменениюСтатусаПартнера(Партнер);
//		
//	КонецЕсли;	
//	
//КонецПроцедуры //-- #Б-1354 смарт: Фролов 14.11.2024	

//++ #Б-1354 смарт: Фролов 14.11.2024 //Алгоритмы заполнения регистра Состояния партнеров
//Процедура смартДействияПоИзменениюСтатусаПартнера(НужныйПартнер)

//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	CRM_Интерес.Ссылка КАК Ссылка
//	|ИЗ
//	|	Документ.CRM_Интерес КАК CRM_Интерес
//	|ГДЕ
//	|	CRM_Интерес.Партнер = &Партнер
//	|	И НЕ CRM_Интерес.ПометкаУдаления
//	|	И НЕ CRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение)
//	|	И НЕ CRM_Интерес.СостояниеИнтереса.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	смартСостояниеПартнеров.Статус КАК Статус
//	|ИЗ
//	|	РегистрСведений.смартСостояниеПартнеров КАК смартСостояниеПартнеров
//	|ГДЕ
//	|	смартСостояниеПартнеров.Партнер = &Партнер
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
//	|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручки
//	|ИЗ
//	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , , АналитикаУчетаПоПартнерам.Партнер = &Партнер) КАК ВыручкаИСебестоимостьПродажОбороты
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер");
//	Запрос.УстановитьПараметр("Партнер", НужныйПартнер);
//	
//	МассивРезультатов = Запрос.ВыполнитьПакет();
//	ТаблицаИнтересы = МассивРезультатов[0].Выгрузить();
//	ТаблицаСтатус = МассивРезультатов[1].Выгрузить();
//	ТаблицаВыручка = МассивРезультатов[2].Выгрузить();
//	
//	Если ТаблицаИнтересы.Количество() > 0 Тогда
//		УстанавливаемыйСтатус = Перечисления.смартСтатусыПартнера.ЕстьИнтерес;	
//	ИначеЕсли ТаблицаВыручка.Количество() > 0 Тогда
//		УстанавливаемыйСтатус = Перечисления.смартСтатусыПартнера.Постоянный;
//	Иначе
//		УстанавливаемыйСтатус = Перечисления.смартСтатусыПартнера.Новый;
//	КонецЕсли;	
//	
//	Если ТаблицаСтатус.Количество() > 0 Тогда
//		
//		Если НЕ ТаблицаСтатус[0].Статус = УстанавливаемыйСтатус Тогда
//			
//			НаборЗаписей = РегистрыСведений.смартСостояниеПартнеров.СоздатьНаборЗаписей();
//			НаборЗаписей.Отбор.Партнер.Установить(НужныйПартнер);
//			НаборЗаписей.Прочитать();

//			НаборЗаписей[0].ПредыдущийСтатус = НаборЗаписей[0].Статус;
//			НаборЗаписей[0].Статус = УстанавливаемыйСтатус;
//			НаборЗаписей[0].ДатаИзмененияСтатуса = ТекущаяДата();
//			
//			НаборЗаписей.Записать(Истина);
//				
//		КонецЕсли;
//		
//	Иначе
//		
//		НаборЗаписей = РегистрыСведений.смартСостояниеПартнеров.СоздатьНаборЗаписей();
//		НаборЗаписей.Отбор.Партнер.Установить(НужныйПартнер);
//		НаборЗаписей.Прочитать();
//		
//		СтрНаборЗаписей = НаборЗаписей.Добавить();
//		СтрНаборЗаписей.Партнер = НужныйПартнер;
//		СтрНаборЗаписей.Статус = УстанавливаемыйСтатус;
//		
//		НаборЗаписей.Записать(Истина);
//		
//	КонецЕсли;	
//	
//КонецПроцедуры //-- #Б-1354 смарт: Фролов 19.11.2024
//-- #Б-2354 смарт: Фролов 17.02.2025
	
#КонецОбласти

#Область КладбищеКода

//++ #Б-2140 смарт: Фролов 11.02.2025 //Ввод нового регламента. Убрать автоматическое создание заметок при квалификации Интереса
//++ #1833 смарт: Фролов 27.05.2024 //Автоматическое создание заметок при квалификации интереса.
//Процедура смартСоздатьЗаметкуОКвалификации(Вариант)
//	
//	НовЗаметка = Справочники.Заметки.СоздатьЭлемент();
//	НовЗаметка.Предмет = Ссылка;
//	НовЗаметка.ПредставлениеПредмета = Ссылка;
//	НовЗаметка.Автор = Ответственный;
//	НовЗаметка.CRM_ЗаметкаЛенты = Истина;
//	НовЗаметка.ДатаЗаметки = ТекущаяДата();
//	Если Вариант = "ПисьмоОНеудачномЗавершении" Тогда
//		НовЗаметка.ТекстСодержания = "Интерес завершён неудачно: " + ПричинаОтказа + " "+ ПричинаОтказаКомментарий;
//	Иначе
//		НовЗаметка.ТекстСодержания = Описание;
//	КонецЕсли;
//	НовЗаметка.Наименование = НовЗаметка.ТекстСодержания;
//	
//	ДокументHTML	= Взаимодействия.ПолучитьДокументHTMLИзОбычногоТекста(НовЗаметка.ТекстСодержания);
//	ТекстHTML		= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
//	ТекстHTML		= СтрЗаменить(ТекстHTML, "size=""2""","");
//	ФорматированныйТекст = Новый ФорматированныйДокумент;
//	ФорматированныйТекст.УстановитьHTML(ТекстHTML, Новый Структура);
//	Содержание = Новый ХранилищеЗначения(ФорматированныйТекст, Новый СжатиеДанных(9));
//	НовЗаметка.Содержание = Содержание;
//	
//	НовЗаметка.смартКвалификация = Истина;
//	НовЗаметка.Записать();
//	
//	ОбщегоНазначения.СообщитьПользователю("По результату квалификации создана заметка!");
//	
//КонецПроцедуры //-- #1833 смарт: Фролов 27.05.2024
//-- #Б-2140 смарт: Фролов 11.02.2025

#КонецОбласти
